benchmarks/http_ab_suite_focus_20260325_003420/local_http_r3_ping_c2048.wrk.out
Running 15s test @ http://127.0.0.1:18080/ping
  16 threads and 2048 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.48ms   48.65ms 951.66ms   98.38%
    Req/Sec     5.65k   734.78    17.71k    87.02%
  Latency Distribution
     50%   21.74ms
     75%   25.64ms
     90%   30.27ms
     99%  236.22ms
  1345671 requests in 15.10s, 147.58MB read
Requests/sec:  89126.76
Transfer/sec:      9.77MB