benchmarks/http_ab_suite_focus_20260325_003420/upstream_ref_http_r2_ping_c2048.wrk.out
Running 15s test @ http://127.0.0.1:18080/ping
  16 threads and 2048 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.44ms   11.53ms 195.00ms   72.72%
    Req/Sec     3.74k   439.58     7.96k    82.36%
  Latency Distribution
     50%   33.60ms
     75%   40.84ms
     90%   48.39ms
     99%   64.79ms
  894113 requests in 15.07s, 98.06MB read
Requests/sec:  59324.31
Transfer/sec:      6.51MB