benchmarks/http_ab_suite_focus_20260325_003420/upstream_ref_http_r4_echo_raw_c2048.wrk.out
Running 15s test @ http://127.0.0.1:18080/echo
  16 threads and 2048 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.01ms   10.05ms 188.97ms   72.44%
    Req/Sec     4.16k   616.16    28.06k    97.63%
  Latency Distribution
     50%   30.58ms
     75%   36.81ms
     90%   43.02ms
     99%   54.00ms
  996103 requests in 15.10s, 116.84MB read
Requests/sec:  65966.07
Transfer/sec:      7.74MB